tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "homebrew/cask-fonts"

brew "lazygit"
brew "lsd"
brew "neovim"
brew "ripgrep"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "nodebrew"
brew "pyenv"
brew "uv"
brew "pngpaste"
brew "gnu-time"
brew "fd"
brew "gcc"

cask "hammerspoon"
cask "wezterm@nightly"
cask "karabiner-elements"
cask "tailscale"
cask "font-hack-nerd-font"
cask "obsidian"
