# --- Tap sources ---
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"

# --- Core CLI tools ---
brew "neovim"
brew "ripgrep"
brew "fd"
brew "lsd"
brew "gnu-time"
brew "gcc"
brew "clang-format"

# --- Dev Language Toolchains ---
brew "go"            # Go + gopls用
brew "nodebrew"      # Node.js version manager
brew "pyenv"         # Python version manager
brew "uv"            # Python環境高速セットアップツール
brew "deno"          # JavaScript/TypeScriptランタイム
brew "rustup-init"   # Rust toolchain installer (optionally)

# --- DevOps / LSP / Git Tools ---
brew "lazygit"       # TUI Gitクライアント
brew "git-delta"     # git diff viewer (better diff)
brew "fzf"           # fuzzy finder (Neovimでも使える)

# --- Clipboard / Image / Utility ---
brew "pngpaste"      # 画像貼り付け
brew "jq"            # JSON CLI parser
brew "htop"          # System monitor
brew "tree"          # directory listing

# --- Cask GUI Tools ---
cask "wezterm@nightly"
cask "hammerspoon"
cask "karabiner-elements"
cask "tailscale"
cask "obsidian"
cask "font-hack-nerd-font"

# --- Optional Extras (if you code Go often) ---
# brew "protobuf"      # for gRPC development
# brew "sqlc"          # SQL -> Go codegen
# brew "air"           # Go live-reload server
# brew "dlv"           # Go debugger
